# ConduitSizeSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeSettings Class
Members See Also
---
Conduit sizes settings
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ConduitSizeSettings : Element,
	IEnumerable<KeyValuePair<string, ConduitSizes>>
```

Visual Basic
---
```text
Public Class ConduitSizeSettings _
	Inherits Element _
	Implements IEnumerable(Of KeyValuePair(Of String, ConduitSizes))
```

Visual C++
---
```text
public ref class ConduitSizeSettings : public Element,
	IEnumerable<KeyValuePair<String^, ConduitSizes^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Electrical..::..ConduitSizeSettings
# See Also
ConduitSizeSettings Members
Autodesk.Revit.DB.Electrical Namespace